
## Plan Result (prod)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 20 to add, 12 to change, 20 to destroy.</code></pre>

* Update
  * azurerm_monitor_action_group.pre-support[0]
  * azurerm_monitor_metric_alert.postgres_alert_active_connections[0]
  * azurerm_monitor_metric_alert.postgres_alert_cpu[0]
  * azurerm_monitor_metric_alert.postgres_alert_failed_connections[0]
  * azurerm_monitor_metric_alert.postgres_alert_memory[0]
  * azurerm_monitor_metric_alert.postgres_alert_storage_utilization[0]
  * azurerm_monitor_metric_alert.storage_final_alert_capacity[0]
  * azurerm_monitor_metric_alert.storage_ingest_alert_capacity[0]
  * module.backup_vault[0].azurerm_data_protection_backup_vault.this
  * module.data_gateway_vm[0].azurerm_windows_virtual_machine.winvm[0]
  * module.data_gateway_vm[1].azurerm_windows_virtual_machine.winvm[0]
  * module.finalsa_storage_account.azurerm_storage_account.storage_account
* Replace
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/fonts/bold-affa96571d-v2.woff&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/fonts/bold-b542beb274-v2.woff2&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/fonts/light-94a07e06a1-v2.woff2&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/fonts/light-f591b13f7d-v2.woff&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/favicon.ico&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/favicon.svg&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/govuk-crest-2x.png&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/govuk-crest.png&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/govuk-icon-180.png&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/govuk-icon-192.png&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/govuk-icon-512.png&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/govuk-icon-mask.svg&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/govuk-opengraph-image.png&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/manifest.json&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/css/govuk-frontend-5.2.0.min.css&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/css/govuk-frontend-5.2.0.min.css.map&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/css/main.css&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/js/b2c.js&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/js/govuk-frontend-5.2.0.min.js&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/js/govuk-frontend-5.2.0.min.js.map&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_monitor_action_group.pre-support[0] will be updated in-place
  ~ resource "azurerm_monitor_action_group" "pre-support" {
        id                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Insights/actionGroups/CriticalAlertsAction"
        name                = "CriticalAlertsAction"
      ~ tags                = {
          - "application"  = "pre-recorded-evidence" -> null
          - "builtFrom"    = "https://github.com/HMCTS/pre-network.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_monitor_metric_alert.postgres_alert_active_connections[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "postgres_alert_active_connections" {
        id                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Insights/metricAlerts/postgres_active_connections_greater_than_80_percent"
        name                     = "postgres_active_connections_greater_than_80_percent"
      ~ tags                     = {
          - "application"  = "pre-recorded-evidence" -> null
          - "builtFrom"    = "https://github.com/HMCTS/pre-network.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_monitor_metric_alert.postgres_alert_cpu[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "postgres_alert_cpu" {
        id                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Insights/metricAlerts/postgres_cpu_percent_95"
        name                     = "postgres_cpu_percent_95"
      ~ tags                     = {
          - "application"  = "pre-recorded-evidence" -> null
          - "builtFrom"    = "https://github.com/HMCTS/pre-network.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_monitor_metric_alert.postgres_alert_failed_connections[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "postgres_alert_failed_connections" {
        id                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Insights/metricAlerts/postgres_failed_connections_greater_than_10"
        name                     = "postgres_failed_connections_greater_than_10"
      ~ tags                     = {
          - "application"  = "pre-recorded-evidence" -> null
          - "builtFrom"    = "https://github.com/HMCTS/pre-network.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_monitor_metric_alert.postgres_alert_memory[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "postgres_alert_memory" {
        id                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Insights/metricAlerts/postgres_memory_percent_95"
        name                     = "postgres_memory_percent_95"
      ~ tags                     = {
          - "application"  = "pre-recorded-evidence" -> null
          - "builtFrom"    = "https://github.com/HMCTS/pre-network.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_monitor_metric_alert.postgres_alert_storage_utilization[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "postgres_alert_storage_utilization" {
        id                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Insights/metricAlerts/postgres_storage_utilization_90"
        name                     = "postgres_storage_utilization_90"
      ~ tags                     = {
          - "application"  = "pre-recorded-evidence" -> null
          - "builtFrom"    = "https://github.com/HMCTS/pre-network.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_monitor_metric_alert.storage_final_alert_capacity[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_final_alert_capacity" {
        id                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Insights/metricAlerts/used_capacity"
        name                     = "used_capacity"
      ~ tags                     = {
          - "application"  = "pre-recorded-evidence" -> null
          - "builtFrom"    = "https://github.com/HMCTS/pre-network.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_monitor_metric_alert.storage_ingest_alert_capacity[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_ingest_alert_capacity" {
        id                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Insights/metricAlerts/used_capacity"
        name                     = "used_capacity"
      ~ scopes                   = [
          - "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/prefinalsaprod",
          + "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/preingestsaprod",
        ]
      ~ tags                     = {
          - "application"  = "pre-recorded-evidence" -> null
          - "builtFrom"    = "https://github.com/HMCTS/pre-network.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/fonts/bold-affa96571d-v2.woff"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presaprod.blob.core.windows.net/pre-b2c-container/assets/fonts/bold-affa96571d-v2.woff" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "assets/fonts/bold-affa96571d-v2.woff" -> "b2c/views/assets/fonts/bold-affa96571d-v2.woff" # forces replacement
      ~ url                    = "https://presaprod.blob.core.windows.net/pre-b2c-container/assets/fonts/bold-affa96571d-v2.woff" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/fonts/bold-b542beb274-v2.woff2"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presaprod.blob.core.windows.net/pre-b2c-container/assets/fonts/bold-b542beb274-v2.woff2" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "assets/fonts/bold-b542beb274-v2.woff2" -> "b2c/views/assets/fonts/bold-b542beb274-v2.woff2" # forces replacement
      ~ url                    = "https://presaprod.blob.core.windows.net/pre-b2c-container/assets/fonts/bold-b542beb274-v2.woff2" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/fonts/light-94a07e06a1-v2.woff2"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presaprod.blob.core.windows.net/pre-b2c-container/assets/fonts/light-94a07e06a1-v2.woff2" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "assets/fonts/light-94a07e06a1-v2.woff2" -> "b2c/views/assets/fonts/light-94a07e06a1-v2.woff2" # forces replacement
      ~ url                    = "https://presaprod.blob.core.windows.net/pre-b2c-container/assets/fonts/light-94a07e06a1-v2.woff2" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/fonts/light-f591b13f7d-v2.woff"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presaprod.blob.core.windows.net/pre-b2c-container/assets/fonts/light-f591b13f7d-v2.woff" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "assets/fonts/light-f591b13f7d-v2.woff" -> "b2c/views/assets/fonts/light-f591b13f7d-v2.woff" # forces replacement
      ~ url                    = "https://presaprod.blob.core.windows.net/pre-b2c-container/assets/fonts/light-f591b13f7d-v2.woff" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/favicon.ico"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presaprod.blob.core.windows.net/pre-b2c-container/assets/images/favicon.ico" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "assets/images/favicon.ico" -> "b2c/views/assets/images/favicon.ico" # forces replacement
      ~ url                    = "https://presaprod.blob.core.windows.net/pre-b2c-container/assets/images/favicon.ico" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/favicon.svg"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presaprod.blob.core.windows.net/pre-b2c-container/assets/images/favicon.svg" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "assets/images/favicon.svg" -> "b2c/views/assets/images/favicon.svg" # forces replacement
      ~ url                    = "https://presaprod.blob.core.windows.net/pre-b2c-container/assets/images/favicon.svg" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/govuk-crest-2x.png"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presaprod.blob.core.windows.net/pre-b2c-container/assets/images/govuk-crest-2x.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "assets/images/govuk-crest-2x.png" -> "b2c/views/assets/images/govuk-crest-2x.png" # forces replacement
      ~ url                    = "https://presaprod.blob.core.windows.net/pre-b2c-container/assets/images/govuk-crest-2x.png" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/govuk-crest.png"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presaprod.blob.core.windows.net/pre-b2c-container/assets/images/govuk-crest.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "assets/images/govuk-crest.png" -> "b2c/views/assets/images/govuk-crest.png" # forces replacement
      ~ url                    = "https://presaprod.blob.core.windows.net/pre-b2c-container/assets/images/govuk-crest.png" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/govuk-icon-180.png"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presaprod.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-180.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "assets/images/govuk-icon-180.png" -> "b2c/views/assets/images/govuk-icon-180.png" # forces replacement
      ~ url                    = "https://presaprod.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-180.png" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/govuk-icon-192.png"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presaprod.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-192.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "assets/images/govuk-icon-192.png" -> "b2c/views/assets/images/govuk-icon-192.png" # forces replacement
      ~ url                    = "https://presaprod.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-192.png" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/govuk-icon-512.png"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presaprod.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-512.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "assets/images/govuk-icon-512.png" -> "b2c/views/assets/images/govuk-icon-512.png" # forces replacement
      ~ url                    = "https://presaprod.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-512.png" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/govuk-icon-mask.svg"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presaprod.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-mask.svg" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "assets/images/govuk-icon-mask.svg" -> "b2c/views/assets/images/govuk-icon-mask.svg" # forces replacement
      ~ url                    = "https://presaprod.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-mask.svg" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/govuk-opengraph-image.png"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presaprod.blob.core.windows.net/pre-b2c-container/assets/images/govuk-opengraph-image.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "assets/images/govuk-opengraph-image.png" -> "b2c/views/assets/images/govuk-opengraph-image.png" # forces replacement
      ~ url                    = "https://presaprod.blob.core.windows.net/pre-b2c-container/assets/images/govuk-opengraph-image.png" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/manifest.json"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presaprod.blob.core.windows.net/pre-b2c-container/assets/manifest.json" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "assets/manifest.json" -> "b2c/views/assets/manifest.json" # forces replacement
      ~ url                    = "https://presaprod.blob.core.windows.net/pre-b2c-container/assets/manifest.json" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/css/govuk-frontend-5.2.0.min.css"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presaprod.blob.core.windows.net/pre-b2c-container/css/govuk-frontend-5.2.0.min.css" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "css/govuk-frontend-5.2.0.min.css" -> "b2c/views/css/govuk-frontend-5.2.0.min.css" # forces replacement
      ~ url                    = "https://presaprod.blob.core.windows.net/pre-b2c-container/css/govuk-frontend-5.2.0.min.css" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/css/govuk-frontend-5.2.0.min.css.map"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presaprod.blob.core.windows.net/pre-b2c-container/css/govuk-frontend-5.2.0.min.css.map" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "css/govuk-frontend-5.2.0.min.css.map" -> "b2c/views/css/govuk-frontend-5.2.0.min.css.map" # forces replacement
      ~ url                    = "https://presaprod.blob.core.windows.net/pre-b2c-container/css/govuk-frontend-5.2.0.min.css.map" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/css/main.css"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presaprod.blob.core.windows.net/pre-b2c-container/css/main.css" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "css/main.css" -> "b2c/views/css/main.css" # forces replacement
      ~ url                    = "https://presaprod.blob.core.windows.net/pre-b2c-container/css/main.css" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/js/b2c.js"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presaprod.blob.core.windows.net/pre-b2c-container/js/b2c.js" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "js/b2c.js" -> "b2c/views/js/b2c.js" # forces replacement
      ~ url                    = "https://presaprod.blob.core.windows.net/pre-b2c-container/js/b2c.js" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/js/govuk-frontend-5.2.0.min.js"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presaprod.blob.core.windows.net/pre-b2c-container/js/govuk-frontend-5.2.0.min.js" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "js/govuk-frontend-5.2.0.min.js" -> "b2c/views/js/govuk-frontend-5.2.0.min.js" # forces replacement
      ~ url                    = "https://presaprod.blob.core.windows.net/pre-b2c-container/js/govuk-frontend-5.2.0.min.js" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/js/govuk-frontend-5.2.0.min.js.map"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presaprod.blob.core.windows.net/pre-b2c-container/js/govuk-frontend-5.2.0.min.js.map" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "js/govuk-frontend-5.2.0.min.js.map" -> "b2c/views/js/govuk-frontend-5.2.0.min.js.map" # forces replacement
      ~ url                    = "https://presaprod.blob.core.windows.net/pre-b2c-container/js/govuk-frontend-5.2.0.min.js.map" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.backup_vault[0].azurerm_data_protection_backup_vault.this will be updated in-place
  ~ resource "azurerm_data_protection_backup_vault" "this" {
        id                         = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.DataProtection/backupVaults/pre-backup-vault-prod"
        name                       = "pre-backup-vault-prod"
      ~ tags                       = {
          - "application"  = "pre-recorded-evidence" -> null
          - "builtFrom"    = "https://github.com/HMCTS/pre-network.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_gateway_vm[0].azurerm_windows_virtual_machine.winvm[0] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "winvm" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Compute/virtualMachines/dg-vm1-prod"
        name                                                   = "dg-vm1-prod"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (41 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_gateway_vm[1].azurerm_windows_virtual_machine.winvm[0] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "winvm" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Compute/virtualMachines/dg-vm2-prod"
        name                                                   = "dg-vm2-prod"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (41 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.finalsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/prefinalsaprod"
        name                              = "prefinalsaprod"
        tags                              = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (63 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "20.50.109.148",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 20 to add, 12 to change, 20 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":803,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->